0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform  $turbulentK;

boundaryField
{
    #include        "include/setConstraintTypes"
    stationaryWalls
    {
        type            fixedValue;
        value           $internalField;
    }  
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }   
    sidePatch
    {
        type            fixedValue;
        value           $internalField;
    }     
    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    floatingObject
    {
        type            kqRWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
