system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

xmin    -120;
xmax     120;
ymin    -120;
ymax     120;
zmin    -320;
zmax     64;

xcell   30;
ycell   30;
zcell   48;


vertices
(
     ($xmin $ymin $zmin)//0
     ($xmax $ymin $zmin)//1
     ($xmax $ymax $zmin)//2
     ($xmin $ymax $zmin)//3   
     ($xmin $ymin $zmax)//4
     ($xmax $ymin $zmax)//5
     ($xmax $ymax $zmax)//6
     ($xmin $ymax $zmax)//7      
);

blocks
(
	hex (0 1 2 3 4 5 6 7) ($xcell $ycell $zcell) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other bcs
    oversetPatch
    {
        type overset;
        faces ();
    }
    
    stationaryWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    
    sidePatch
    {
        type patch;
        faces
        (
            (1 5 4 0) // front
            (3 7 6 2) // back
        );
    }
    
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
