system/markCellDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

markRegionNames ("freesurface_in" "body"); //"body"


tarCellHeight 2.0;

TotalZ   #calc "$tarCellHeight * 2";

freesurface_inRegionControl
{


zoneMaxX  10000;
zoneMinX -10000;
zoneMaxY  10000;
zoneMinY -10000;
zoneMaxZ  $TotalZ;
zoneMinZ -$TotalZ;


}


freesurface_outRegionControl
{


zoneMaxX  20000;
zoneMinX -20000;
zoneMaxY  20000;
zoneMinY -20000;
zoneMaxZ 0.384615384615;
zoneMinZ -0.384615384615;



}

bodyRegionControl
{

zoneMaxX  26;
zoneMinX -26;
zoneMaxY  26;
zoneMinY -26;
zoneMaxZ  30;
zoneMinZ -140;

}






// ************************************************************************* //
