system/markCellDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

markRegionNames ("freesurface_in" "body"); //"body" "freesurface_in","freesurface_out"


tarCellHeight 8;

TotalZ   #calc "$tarCellHeight * 2";

freesurface_inRegionControl
{


zoneMaxX  10000;
zoneMinX -10000;
zoneMaxY  10000;
zoneMinY -10000;
zoneMaxZ  $TotalZ;
zoneMinZ -$TotalZ;


}


freesurface_outRegionControl
{


zoneMaxX  20000;
zoneMinX -20000;
zoneMaxY  20000;
zoneMinY -20000;
zoneMaxZ 0.384615384615;
zoneMinZ -0.384615384615;



}

bodyRegionControl
{

    zoneMaxX  48;
    zoneMinX -48;
    zoneMaxY  48;
    zoneMinY -48;
    zoneMaxZ  50;
    zoneMinZ -180;
}






// ************************************************************************* //
