system/zoneRangeCalculatorDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      zoneRangeCalculatorDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

blockMeshVerticalDimension 3;   //change
blockMeshVerticalCellNumber 60;  //change

blockMeshHorizontalDimension 2; //change
blockMeshHorizontalCellNumber 40; //change

blockMeshTransverseDimension 1.8; //change
blockMeshTransverseCellNumber 64; //change

N_cellsInBuffLayer 3;


targetWaveElevation 0.05;//change
targetWaveRefineZoneCoef 0.05; 
N_freesurfaceRefineLevels 3;

N_OversetRegionRefineLevels 1;

OversetVerticalRegionDimension 1;
OversetHorizontalRegionDimension 1;
OversetTransverseRegionDimension 1;




// ************************************************************************* //
